# ДЗ:
# 1. Создать функцию, которая выводит на экран цифру, введенную пользоватлем в консоли.
def temirlan():
    value = input("Введите число: ")
    print(value)

temirlan()
1