# ДЗ:
# 1. Создать функцию, которая выводит на экран цифру, введенную пользоватлем в консоли.
value = input("Введите число: ")
print(value)

